// 质数是只能被1和它本身整除
------------------------------------------------------------------------------------------------
------------------------------------------------------------------------------------------------
// C语言:
// 先对一个数开方，得到k，开始便利遍历，如果这个数可以整除(k+1)内的数，则这个数不是质数，否则输出这个数

#include "stdio.h"
int main(void){
  int i,k;
  printf("2");
  for(i=3;i<101;i+=2){
    for(k=3;k*k<=i;k+=2)
      if(i%k==0)
        break;
    if(k*k<=i)
      continue;
    printf(" %d",i);
  }
    printf("\n");
  return 0;
}

------------------------------------------------------------------------------------------------
------------------------------------------------------------------------------------------------
// MatLab:
for i = 2:100              %外层循环，i的初值是2，终值为100
    for j = 2:100          %内层循环，j的初值为2，终值为100
        if (~mod(i,j))     %i除以j取余后再取反
            break;         %跳出循环
        end
    end
    if(j > (i/j))
       fprintf('%d is prime \n',i); 
    end
end




